[{"id":"cfc9689e-305b-432d-8acd-ba355f284c48","type":"Full Time","url":"https://jobs.github.com/positions/cfc9689e-305b-432d-8acd-ba355f284c48","created_at":"Thu Nov 21 23:08:54 UTC 2019","company":"Sympo, Inc","company_url":null,"location":"San Dimas, California","title":"Software Programmer","description":"\u003cp\u003eSympo®, Inc., with an office in San Dimas, CA , is an award-winning Quick Base® Solution Provider. Our Quick Base® Developer team provides businesses, across all industry categories, solutions to problems they didn’t even know they had! Our solutions are flexible, scalable, cost-effective and leverage web-based tools.\nSympo® is a growing and dynamic company, and we pride ourselves on our service, experience, knowledge, ethics and enthusiasm. Our mission and philosophy are quite simple: become our client’s trusted advisor, provide unparalleled services and serve our clients with integrity.\u003c/p\u003e\n\u003cp\u003eWe currently have an opening on our Development Team for a Software Programmer in our San Dimas office. This position will provide advanced software programming capabilities coupled with Quick Base® application development and integration with other business systems. Solutions for our clients that are customized to meet their specific business needs.\nWe are looking for Software Programmers with experience and knowledge with programming languages such as (combination of any of the following) Python, JavaScript, jQuery, Ruby on Rails, PHP and HTML5 is required. This position will also be tasked with developing scripts, interacting with API’s and building web forms. And a demonstrable proficiency of exemplary level of organization and productivity.  This position will require attention to detail, the ability to work unsupervised effectively and efficiently, lead client-facing project activities that include analyzing client business needs, design and build custom database applications in Quick Base®.\u003c/p\u003e\n\u003cp\u003eSOFTWARE PROGRAMMER REQUIRED EXPERIENCE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a Python Developer to interact with RESTful web services, push and pull data from various systems via Python’s requests and other supporting libraries\u003c/li\u003e\n\u003cli\u003eUtilization of prebuilt classes and/or SDKs to enhance build speed and consistency. Add enhancements as necessary to reusable internal libraries and classes\u003c/li\u003e\n\u003cli\u003eExperience with Django-based web application development and configuration to run under Apache on a Unix OS-based system. OR, Similar experience with a modern web application framework (e.g. Ruby on Rails) and a desire to learn a new framework.\u003c/li\u003e\n\u003cli\u003eBuild Django views to display HTML based templates that render and accept data in various formats. (E.g. calendars, input forms, PDF Documents)\u003c/li\u003e\n\u003cli\u003eExperience in UNIX Server management and set-up for web applications (e.g. install and configure Apache including CSR generation and SSL certificate installation)\u003c/li\u003e\n\u003cli\u003eSchedule scripts via cron utility and proficiency working via SSH and SFTP\u003c/li\u003e\n\u003cli\u003eHTML AND JavaScript Development, create layouts, display data in styled format using HTML and CSS3. Experience with best practices for performance, responsive design, and cross-browser compatibility/limitations.\u003c/li\u003e\n\u003cli\u003eExperience contributing to and maintaining repositories in a version control system (e.g. Github or Subversion)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDESIRABLE EXPERIENCE AS A SOFTWARE PROGRAMMER COUPLED WITH QUICK BASE®\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eConsulting Background\u003c/li\u003e\n\u003cli\u003eExpertise in building Apps in Quick Base® using the Quick Base® Application Development Platform\u003c/li\u003e\n\u003cli\u003eLeadership in technical design and business process requirements including a combination of functionality and technical vision between usability, performance and budget options\u003c/li\u003e\n\u003cli\u003eCommunication and leadership skills\u003c/li\u003e\n\u003cli\u003eProject management and ability to drive software technology best practices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou must have demonstrable experience working as a Software Programmer; self-motivated, self-managed and accountable.\u003c/p\u003e\n\u003cp\u003eUpon employment, the successful candidate will need to present evidence of their U.S. Citizenship or their legal right to live and work in the U.S.\u003c/p\u003e\n\u003cp\u003eSympo®, Inc. works as a team. Each and every individual here is key to our success! We enjoy a comfortable office environment that is professional, entrepreneurial, friendly, and supportive. We constantly strive to better our knowledge and performance, for the benefit of ourselves and our clients. We offer competitive compensation (based on experience) and benefits. If you are an experienced Software Programmer and if this is the environment you are looking for, send your resume and tell us why you should be our next Software Development Team Member.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:resumes@sympo.com\"\u003eresumes@sympo.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDk0IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--54928a55256e59fc6f676c878f384d7734eaac0e/symp_cap2.png"},{"id":"b0d46b76-a0f8-48c1-bce4-b24190e88d58","type":"Full Time","url":"https://jobs.github.com/positions/b0d46b76-a0f8-48c1-bce4-b24190e88d58","created_at":"Wed Nov 20 07:33:08 UTC 2019","company":"Institute for Creative Integration","company_url":"http://creative-integration.com","location":"Los Altos, CA","title":"Full-time Contract Interaction Designer (junior to mid level)","description":"\u003cp\u003eStarting immediately till March 2020, working onsite in the South Bay, the contract Interaction Designer will be responsible for translating user experience narratives into pseudocode and other interaction design implementation tools. Working closely with the engineering team, this position will understand the intention of the interaction scenario and will be capable to implement multimodal interactions effectively.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003e-Translate narratives into structured and implementable description that engineers will understand how exactly they should code.\u003c/p\u003e\n\u003cp\u003e-Utilizing pseudocode or Markup Languages to adjust the interaction flow.\nDevelop and present documentation, user flows, annotated wireframes, and interactive prototypes\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003e-Bachelor Degree in Human Computer Interaction (HCI) or equivalent\u003c/p\u003e\n\u003cp\u003e-2+ years' of experience in interaction design involving multimodal scenarios\u003c/p\u003e\n\u003cp\u003e-Proficient in wire framing tools, Markup Languages, such as HTML and SSML\u003c/p\u003e\n\u003cp\u003e-Experience in using GitHub\u003c/p\u003e\n\u003cp\u003e-Basic meta knowledge about coding, such as JavaScript or Python\u003c/p\u003e\n\u003cp\u003e-Fast learner\u003c/p\u003e\n\u003cp\u003e-Japanese-English bilingual is a plus\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:career@creative-integration.com\"\u003ecareer@creative-integration.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHgzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4bbe0ea7a6168a84638594585d741c6aeb343ccd/logo-120x120.png"},{"id":"929b69e6-101c-4fdf-8643-27e6661d3ab9","type":"Full Time","url":"https://jobs.github.com/positions/929b69e6-101c-4fdf-8643-27e6661d3ab9","created_at":"Wed Nov 13 23:09:35 UTC 2019","company":"Scale Inc","company_url":"http:","location":"Sherman Oaks","title":"Senior Full Stack Developer (PHP)","description":"\u003cp\u003eScale is a tech-driven,direct-to-consumer platform that develops and deploys cutting-edge consumer brands from concept to scale, efficiently, profitably and quickly. We are obsessed with perfecting our proprietary technology, processes and methodologies that allow for rapid growth, from inception to SCALE.\u003c/p\u003e\n\u003cp\u003eTogether we have a lifetime of experience in health, nutrition, entertainment, advertising, creative, media buying, strategy, performance optimization, and leadership. We have achieved success that has resulted in thousands of lives changed and millions of dollars in revenue.\u003c/p\u003e\n\u003cp\u003eWe use an analytical approach and technology to power our growth engine, and are looking for  an experienced senior full-stack engineer to join and help build and improve our web properties. You’ll work with our team of engineers to build and maintain features that create rich and compelling experiences for our customers, and expand the platform that drives our business operations.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eWrite and maintain code primarily in PHP and JavaScript (along with other languages as needed)\nDesign / architect / build new applications, features, and tools\nHelp improve system performance and scalability\nHelp track down and fix system bugs\nHelp mentor junior developers\nQualifications:\n5+ years experience developing web applications\n3+ years of PHP experience with an MVC framework\nExperience with frontend Javascript libraries/frameworks (jQuery, React, Angular)\nExperience building and consuming APIs and web services\nExperience working with relational databases such as MySQL containing large amounts of data\nStrong grasp of technologies across the stack from the browser to the server\nStrong understanding of the browser DOM\nStrong communication skills both written and verbal\u003c/p\u003e\n\u003cp\u003eBonus Qualifications:\u003c/p\u003e\n\u003cp\u003eExperience with Node.js\nExperience with additional languages such as Go, Python, Java, etc.\nHands on experience with containerization and orchestration (Docker / Kubernetes)\nContributions to open source projects\u003c/p\u003e\n\u003cp\u003eWho We Are:\u003c/p\u003e\n\u003cp\u003eScale owns and operates several brands in the health and beauty verticals (our biggest - \u003ca href=\"https://1md.org\"\u003ehttps://1md.org\u003c/a\u003e, \u003ca href=\"https://hairlavie.com\"\u003ehttps://hairlavie.com\u003c/a\u003e). We formulate best-in-class supplement and care products based on clinical studies and in partnership with doctors and medical labs.\nWe sell our products online on eCommerce websites that are powered by our in-house eCommerce platform, built with the Zend Framework (LEMP stack). Our eCommerce platform controls every aspect of our websites as well as many of our business operations, such as customer service, inventory management, deep reporting and analytics and much more.\u003c/p\u003e\n\u003cp\u003eWhat We Offer:\u003c/p\u003e\n\u003cp\u003eCompetitive Salary Commensurate with Years of Experience\nMedical, dental, vision and life insurance\nGym Membership\nOffice Snacks\nYoga, meditation and dance breaks\nCasual Dress\nCompany Outings\nPaid time off\u003c/p\u003e\n\u003cp\u003eLocal Candidates Highly Preferred\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply: Please email resume to \u003ca href=\"mailto:amanda.h@scale.tech\"\u003eamanda.h@scale.tech\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"a5c8b668-9f4b-409b-af4e-d9c4ca6771c1","type":"Full Time","url":"https://jobs.github.com/positions/a5c8b668-9f4b-409b-af4e-d9c4ca6771c1","created_at":"Tue Nov 05 23:00:04 UTC 2019","company":"Fictiv","company_url":"http://www.fictiv.com","location":"san Francisco","title":"Software Engineer, ERP","description":"\u003cp\u003eWhat You’ll Be Doing\u003c/p\u003e\n\u003cp\u003eBusiness systems are the backbone of Fictiv. As a Business Systems Engineer, you build and support the systems that run our day-to-day back office operations. These systems are critical to our success as they are used both for internal efficiency and for providing visible, real-time status to our customers. With your background in software engineering, you offer creative technology alternatives to manual work and enable the entire business to be more productive.\u003c/p\u003e\n\u003cp\u003eIn this role, you will use modern technology and techniques to coordinate work across Fictiv’s global manufacturing network. You will bring or develop expertise in security, reliability, and performance as we expand overseas. You will work closely with our architecture team to design technical solutions that involve advanced software configuration, domain-driven system design, and automation through custom software. In our web-based environment you'll use your experience with Python and SQL to improve Odoo  and assist with deployment and debugging.\u003c/p\u003e\n\u003cp\u003eDesired traits\u003c/p\u003e\n\u003cp\u003eTechnical expertise – You are adept at creating and managing a distributed application, particularly one where work is divided and routed to regionally distributed nodes. You can get up to speed on complex data domains quickly, particularly through multiple levels of abstraction and inheritance.\u003c/p\u003e\n\u003cp\u003ePractical engineering – You carefully consider when to leverage third party software and when to apply customized solutions. You understand the importance of keeping a firm boundary between customization code and third party code to protect business processes and intellectual property.\u003c/p\u003e\n\u003cp\u003eHighly responsible – You understand the importance of keeping critical systems available. You hold both yourself and your colleagues accountable for ensuring uptime in the face of frequent improvements. You are able and willing to work outside of regular business as necessary for incident responses and offshore coordination.\u003c/p\u003e\n\u003cp\u003eTeam-oriented – You have a strong desire to help the entire team level up and improve our collective craft.  You work well with peers and leads who are geographically distributed (including offshore developers).\u003c/p\u003e\n\u003cp\u003eExperience with GraphQL, Severless and Javascript are pluses!\u003c/p\u003e\n\u003cp\u003eWhat It’s Like to Work at Fictiv\u003c/p\u003e\n\u003cp\u003eWe’re a small, close-knit team with a core group in San Francisco and a few remote engineers around the country.  While all engineers need protected time to get things done, we also believe collaboration and creative tension create the best product. That’s why we encourage a rhythm of heads down, independent work followed by focused constructive debate.\u003c/p\u003e\n\u003cp\u003eProduct development teams follow the principles from the Scrum Guide.  We’re practical about process (we use what works), but we’ve found Scrum ceremonies to be a positive framework for transparency and collaboration. To save time, we keep Sprint Plannings to 1 hour and Sprint Reviews to 45 minutes for our two-week sprints.\u003c/p\u003e\n\u003cp\u003eSince we are a small team, all engineers (including managers) are on-call for two weeks out of every 8-10 weeks. This builds team cohesion and deepens our understanding of our production system. We are all here to support one another, so if you have personal events during this time we’re happy to swap slots or cover for you.\u003c/p\u003e\n\u003cp\u003eWe’re constantly evolving our practices, so please feel free to ask questions and share your thoughts as well!\u003c/p\u003e\n\u003cp\u003eWhat’s In It For You\u003c/p\u003e\n\u003cp\u003eWe strive to contribute to the well-being of our team beyond Health (of which we pay 85% per employee and 60% for dependents which an increase in contribution in January), Dental and Vision insurance. We offer our team members the following:\u003c/p\u003e\n\u003cp\u003eDog friendly office\u003c/p\u003e\n\u003cp\u003eLunch everyday plus breakfast essentials like bagel and stocked snacks\u003c/p\u003e\n\u003cp\u003eTransit subsidy up to $75/month and up to $50/month for expenses related to health and wellness\u003c/p\u003e\n\u003cp\u003eEducation Stipend up to $1400/year for conferences, classes (online or in-person), workshops, and professional certifications related to your role\u003c/p\u003e\n\u003cp\u003eLiterature Stipend up to $100/quarter on literature related to your role\u003c/p\u003e\n\u003cp\u003eCommunity days where you contribute to your community and enrich both yourself and organizations of your choice.  Each year, you can use up to two days as community days.\u003c/p\u003e\n\u003cp\u003eHappy hours and demo days to showcase what you’re working on and AMA’s from the Executive team!\u003c/p\u003e\n\u003cp\u003eAbout Fictiv (\u003ca href=\"http://www.fictiv.com\"\u003ewww.fictiv.com\u003c/a\u003e)\u003c/p\u003e\n\u003cp\u003eAt Fictiv, we’re inspired every day by our customers and teammates.\u003c/p\u003e\n\u003cp\u003eWe support a community that includes some of the most talented people on the planet.  You’ll design for hardware engineers who are literally building the future today (think autonomous vehicles, spaceships, next-gen medical devices) and partner with some of the most skilled manufacturers who produce the seemingly impossible.\u003c/p\u003e\n\u003cp\u003eFor decades, these innovators have had to endure long feedback cycles and high upfront costs to bring their products to market.  Our system drastically reduces the time and cost while allowing hardware engineers to experiment faster and with better outcomes.  Come play a critical role in shaping this system into becoming the go-to platform for hardware development.\u003c/p\u003e\n\u003cp\u003eWe’re actively seeking potential teammates who can bring diverse perspectives and experience to our culture and company. We believe inclusion is the best way to create a strong, empathetic team. Our belief is that the best team is born from an environment that emphasizes respect, honesty, collaboration, and growth.\u003c/p\u003e\n\u003cp\u003eWe encourage applications from members of underrepresented groups, including but not limited to women, members of the LGBTQ community, people of color, people with disabilities, and veterans.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/fictiv/jobs/4382779002\"\u003ehttps://boards.greenhouse.io/fictiv/jobs/4382779002\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"90da324b-acfb-4542-998a-b815968a352c","type":"Full Time","url":"https://jobs.github.com/positions/90da324b-acfb-4542-998a-b815968a352c","created_at":"Tue Nov 05 20:32:26 UTC 2019","company":"Ripcord","company_url":"http://Ripcord.com","location":"Hayward","title":"Software Engineer","description":"\u003cp\u003eJOB DESCRIPTION\nAbout Us:\nRipcord is the world's first robotic paper digitization company. We’re going after the outmoded, but very large paper records market (think, medical records, company HR records, company financial records, legal case files, etc). For 30 years the world has been talking about the paperless office, but have yet to realize it. Our mission is to be the company that takes the world paperless. We are doing this by building a first of its kind robotic machine and software platform that will completely transform the records management market.\u003c/p\u003e\n\u003cp\u003eOur headquarters and production facility are in Hayward, CA. We have also have a co-working space in San Francisco.\u003c/p\u003e\n\u003cp\u003eWe are a well-funded startup backed by reputable investors such as Icon Ventures, Google Ventures, Kleiner Perkins, LUX Capital, and Silicon Valley Bank. Our seed investors and advisors include Steve Wozniak, Bruce Scott, Chris C Kemp, and Jon Callas.\u003c/p\u003e\n\u003cp\u003eWe respect and look after one another at Ripcord. We want everyone to feel supported, safe, free to innovate and take risks that result in breakthroughs that challenge the status quo. Crazy ideas are welcome here! Our team is fun, driven, and energetic. Every day we work with industrial robots, computer vision systems, and a diverse stack of software tools to tie it all together.\u003c/p\u003e\n\u003cp\u003ePosition Overview\u003c/p\u003e\n\u003cp\u003eA software engineer on the Automation team will develop and maintain the applications used in the robotic digitization of paper documents. This role also involves developing the core infrastructure that will serve as the foundation of the automation software stack.\u003c/p\u003e\n\u003cp\u003eIn this role, the candidate will collaborate with other teammates to implement solutions to problems that impact the company’s top software engineering priorities. They will also introduce, assess, and implement new technologies that will help the company scale its existing software solutions.\u003c/p\u003e\n\u003cp\u003eEngineers in this position have solid programming fundamentals, are willing to learn new technologies, and can work effectively with a team.\u003c/p\u003e\n\u003cp\u003eWho Will Love This Position\u003c/p\u003e\n\u003cp\u003eTop performers who are able to drive features from inception to deployment\nCurious and creative individuals who are able to apply the right technologies and solutions to complex problems\nStrong coders who have a passion for organization and documentation\nTeam players who want to mentor others\nResponsibilities\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software systems that support the robotic digitization of paper\nOptimize software processes to increase machine throughput\nPeer review code for accuracy and style\nArchitect and plan new features and systems\u003c/p\u003e\n\u003cp\u003eQualifications, Education, Years of Experience \u0026amp; Skills:\u003c/p\u003e\n\u003cp\u003eBachelors, Masters, or PhD  and 4+ years of software development experience\u003c/p\u003e\n\u003cp\u003eExperience with C#, Java, Python or another object-oriented language\u003c/p\u003e\n\u003cp\u003eFamiliarity with Jira, Git and agile development methodology\u003c/p\u003e\n\u003cp\u003eExperience with relational and NoSQL databases\u003c/p\u003e\n\u003cp\u003eExpertise in developing APIs (REST, gRPC, etc)\u003c/p\u003e\n\u003cp\u003eExperience with service-oriented architecture\u003c/p\u003e\n\u003cp\u003eBonus Points:\u003c/p\u003e\n\u003cp\u003eMicroservice development\u003c/p\u003e\n\u003cp\u003eExperience with distributed messaging services (SQS or Kafka)\u003c/p\u003e\n\u003cp\u003eExperience building cloud solutions for AWS, GCP, Azure, etc\u003c/p\u003e\n\u003cp\u003eKnowledge of Elasticsearch, Logstash, Kabana (ELK) Stack\u003c/p\u003e\n\u003cp\u003eExperience with building and deploy systems (Azure DevOps, Chef / Inspec, Terraform, Docker, and Kubernetes)\u003c/p\u003e\n\u003cp\u003ePerks:\nStock options\u003c/p\u003e\n\u003cp\u003e100% of healthcare premiums are covered for you and all dependents!\u003c/p\u003e\n\u003cp\u003eGreat vision \u0026amp; dental insurance\u003c/p\u003e\n\u003cp\u003eFree gym \u0026amp; refreshments on-site\u003c/p\u003e\n\u003cp\u003eCommuting benefits\u003c/p\u003e\n\u003cp\u003eComprehensive leave policy\u003c/p\u003e\n\u003cp\u003eEqual Opportunity Employer\u003c/p\u003e\n\u003cp\u003eAt Ripcord, we don’t just accept difference — we celebrate it, we support it. Ripcord is proud to be an equal opportunity workplace. Our goal is to be a diverse workforce at all job levels. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, transgender status, age, marital status, veteran status, or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eClick Here: \u003ca href=\"https://careers.jobscore.com/apply_flow/standard_applications/apply?job_id=d8Rq6KTkGr6yftaKld2Sj6\"\u003ehttps://careers.jobscore.com/apply_flow/standard_applications/apply?job_id=d8Rq6KTkGr6yftaKld2Sj6\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckYyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4a27bc8b76b0147e5eb06bcaf6206846d37ba428/ripcord-logo-color-400X127%20(1).png"},{"id":"382a336d-d30f-4b87-9d0a-715c94381f35","type":"Full Time","url":"https://jobs.github.com/positions/382a336d-d30f-4b87-9d0a-715c94381f35","created_at":"Tue Nov 05 00:20:39 UTC 2019","company":"Grimaldi Staffing ","company_url":"http://grimaldistaffingservices.com/home-3/jobs/","location":"Menlo Park ","title":"Sr. Software Engineer (Full Stack, BackEnd Focus)","description":"\u003cp\u003eSummary\u003c/p\u003e\n\u003cp\u003eThis company is a well-funded start-up company in the Medical Diagnostics market. the company's platform will revolutionize the market by bringing our diagnostic system to doctors’ offices and clinics, providing convenience to the patient with timely results. As a member of the Software and Informatics team, you will be a key member designing and developing software for our platform.\u003c/p\u003e\n\u003cp\u003eOur Team\u003c/p\u003e\n\u003cp\u003eThe Software team is responsible for the cloud implementation that the instruments will interface with securely, storing and processing these data and presenting these data to users on an installable application. Additionally, our team is tasked with integrating other business tools into our system as well as enabling integration with electronic medical record systems. As a team, we’ve embraced serverless architectures, de-coupling services wherever possible and enabling scalability and high availability.\u003c/p\u003e\n\u003cp\u003eOur Stack\u003c/p\u003e\n\u003cp\u003eOur application is developed using ReactJS/Redux and ElectronJS, with a backend that utilizes various AWS services (RDS, EC2, SQS, SNS, ELB, API-GW, Lambda, Cognito, Cloudwatch, S3, etc) and Django/Python Docker containers as well as NodeJS based microservices. Our databases are predominantly AWS’ RDS Postgres and are adopting Elasticache for high performance.\u003c/p\u003e\n\u003cp\u003eThis position\u003c/p\u003e\n\u003cp\u003eAs a full-stack Sr. Software Engineer you’ll be heavily involved in the development of applications and platforms that enable physicians and other healthcare professionals manage patient medical reports using the latest in backend-frontend design paradigms. Given the full-stack nature of this position, you will have an intimate grasp of the system architecture and be a resource for other engineers on the team and at times shifting development across front-end through to back-end.\u003c/p\u003e\n\u003cp\u003eRole \u0026amp; Responsibilities\u003c/p\u003e\n\u003cp\u003eYou would join us in building out new features on this application, review architectural plans and support front-end and back-end development and integration points, coordinate testing with the QA team and mentor software engineers as we build the team. As an engineer with visibility on both FE and BE you will play a significant role in roadmapping integration with additional toolsets (built in-house as well as third parties). You will have an intimate knowledge of the entire infrastructure and write and review code that affects every part of the product. As a seasoned professional, you will ensure development best practices are applied, including coding standards, code reviews, unit testing, release and deployment standards, version control, and documentation.\u003c/p\u003e\n\u003cp\u003eAbout You\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an individual passionate about using the right tool for the job, forever curious about the latest software developments and emerging design patterns\u003c/li\u003e\n\u003cli\u003eYou believe firmly in testing and can’t imagine building without\u003c/li\u003e\n\u003cli\u003eExpert in ES6 JavaScript development (FE and Node) skills with experience in writing modular, object-oriented code\u003c/li\u003e\n\u003cli\u003ePrevious experience with ReactJS or Angular, Node, Babel, Webpack and related technologies\u003c/li\u003e\n\u003cli\u003eUnderstand the fundamentals of database design and optimization\u003c/li\u003e\n\u003cli\u003eHave had experience in working across a full stack in production\u003c/li\u003e\n\u003cli\u003eStrong grasp of semantic HTML, modular CSS, ES6 standards, responsive design, asynchronous and non-blocking UI approaches\u003c/li\u003e\n\u003cli\u003eWrite clear and thorough API documentation, as well as review documentation and code written by others\u003c/li\u003e\n\u003cli\u003eIntimately familiar with Software Development Lifecycle, including Agile/Scrum methodologies\nAware of the latest web technology developments and trends with a keen understanding of the tradeoffs in order to provide insights into how they may fit into our software strategy\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther skills and experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA BS/MS in Computer Science (or equivalent experience) with at least 6+ years’ relevant industry experience\u003c/li\u003e\n\u003cli\u003eExperience with RDMS, NoSQL and In-Memory data stores\u003c/li\u003e\n\u003cli\u003eExperience with unit testing library like Mocha and JEST\u003c/li\u003e\n\u003cli\u003eExperience with AWS or any similar cloud computing platforms\u003c/li\u003e\n\u003cli\u003eIVD software development and healthcare regulatory standards (e.g., IEC62304)\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSend resume to: \u003ca href=\"mailto:careers@grimaldistaffingservices.com\"\u003ecareers@grimaldistaffingservices.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"e47453b4-4ac6-4dc5-9311-2a58a4525017","type":"Full Time","url":"https://jobs.github.com/positions/e47453b4-4ac6-4dc5-9311-2a58a4525017","created_at":"Mon Nov 04 19:42:53 UTC 2019","company":"Pagebites, Inc.","company_url":null,"location":"Palo Alto","title":"Audio/Video Software Engineer","description":"\u003cp\u003ePagebites Inc. is a fast growing company based in Palo Alto, California and our messaging app, imo.im, is extremely popular internationally. Our current team consists of TopCoders, ACM ICPC World Finalists, and medalists of the International Olympiads in Informatics. We work on challenging projects that have direct impact on our 200-million monthly-active users.\u003c/p\u003e\n\u003cp\u003eWe are currently seeking software engineers to join our AV team in working on our real-time audio and video calling application. Hundreds of millions of users use our calling platform every day and being part of our small team will give you the opportunity to make huge impact.\u003c/p\u003e\n\u003cp\u003eOur ideal candidate has a strong background in data structures, algorithms, design, and coding.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eWork closely with client and backend teams to take the audio/video calls to the next level\nDesign, develop and test core audio/video systems\nTraffic routing, peer-to-peer\nCongestion control, throughput and latency optimization\nDigital signal processing\nCodecs\nNetwork protocols and encryptions\u003c/p\u003e\n\u003cp\u003eMinimum qualifications:\u003c/p\u003e\n\u003cp\u003eBS/MS/PhD in computer science (or the equivalent)\nStrong grasp of data structures and algorithms\u003c/p\u003e\n\u003cp\u003ePreferred qualifications:\u003c/p\u003e\n\u003cp\u003eExperience in Audio/Video encoding/decoding and processing\nExtensive experience writing networking code in C/C++\nExperience with real time audio and video communication systems\nThorough understanding of TCP/IP and network programming\nExperience building and designing scalable distributed systems\nAdept at hacking open source software\nExperience in Python and Java\u003c/p\u003e\n\u003cp\u003eBenefits \u0026amp; Perks:\u003c/p\u003e\n\u003cp\u003eCompetitive salary\n$500/month housing stipend for living within a five-mile radius of the office\nFour weeks of paid vacation per year (plus paid holidays and sick days)\n401(k), medical, dental and vision benefits\nCatered lunch daily and a fully-stocked kitchen\nData plan reimbursement\nWellness program\nYearly conference stipend\nCompany-sponsored team events and outings\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/imoim/jobs/1868815\"\u003ehttps://boards.greenhouse.io/imoim/jobs/1868815\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"a8c5fbb3-0f93-4846-8080-00467cad4a9b","type":"Full Time","url":"https://jobs.github.com/positions/a8c5fbb3-0f93-4846-8080-00467cad4a9b","created_at":"Sun Nov 03 20:52:10 UTC 2019","company":"Gilead Sciences","company_url":"https://www.gilead.com/","location":"Foster City, CA","title":"Senior Manager, Data Science","description":"\u003cp\u003e\u003cstrong\u003eBackground\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe data scientist will be responsible for supporting Gilead’s PDM (Pharmaceutical Development and Manufacturing) department’s greater use of data in reporting, analytics, visualizations, and obtaining insights. They will be responsible for be applying data sciences techniques to continue to improve our knowledge management, perform predictive analytics, and identify trends in scientific and operational data sets. Furthermore, they will advance artificial intelligence and machine learning throughout PDM to uncover patterns, correlations, and new insights in data that would otherwise be difficult to do due to large data volumes and data in various systems with different data models and structures\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Skills and Education\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eExperience managing data science teams\u003c/p\u003e\n\u003cp\u003eDegree in computer science, math, statistics, life science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtensive data modeling and data architecture skills\u003c/p\u003e\n\u003cp\u003eProgramming experience in Python and R. You should know the limits and benefits of statistical programming languages.\u003c/p\u003e\n\u003cp\u003eLower level programming experience in languages like C#, C++ or Java\u003c/p\u003e\n\u003cp\u003eBackground in machine learning frameworks such as TensorFlow and Keras\u003c/p\u003e\n\u003cp\u003eExpertise in common R and Python packages like GGplot, DPLYR, and Plumber\u003c/p\u003e\n\u003cp\u003eKnowledge of how to analyze and manage large data sets as well as strategies for visualizing and communicating results to solve business needs\u003c/p\u003e\n\u003cp\u003eKnowledge of Hadoop or another distributed computing systems is a plus\u003c/p\u003e\n\u003cp\u003eExperience working in an Agile environment\u003c/p\u003e\n\u003cp\u003eAdvanced math skills (linear algebra, Bayesian statistics, group theory)\u003c/p\u003e\n\u003cp\u003eStrong written and verbal communications\u003c/p\u003e\n\u003cp\u003eFamiliarity with cGMP, computer validation concepts and pharmaceutical regulatory compliance, including data integrity, quality analytics, 21 CFR Part 11, EU Annex 11, and familiarity with as 21 CFR parts 58, 210, 21 is a plus.\u003c/p\u003e\n\u003cp\u003eJob ID: R0010039\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://gilead.wd1.myworkdayjobs.com/en-US/gileadcareers/job/United-States---California---Foster-City/Sr-Manager--Data-Scientist_R0010039-2\"\u003ehttps://gilead.wd1.myworkdayjobs.com/en-US/gileadcareers/job/United-States---California---Foster-City/Sr-Manager--Data-Scientist_R0010039-2\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://gilead.wd1.myworkdayjobs.com/en-US/gileadcareers/job/United-States---California---Foster-City/Sr-Manager--Data-Scientist_R0010039-2\"\u003ehttps://gilead.wd1.myworkdayjobs.com/en-US/gileadcareers/job/United-States---California---Foster-City/Sr-Manager--Data-Scientist_R0010039-2\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eJob ID: R0010039\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGgyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--83d07f90e24ffd944884a6719db330c59be8e830/gileadscienceslogo.jpg"},{"id":"236f3c97-1b16-4a9c-a877-46da0da445b4","type":"Full Time","url":"https://jobs.github.com/positions/236f3c97-1b16-4a9c-a877-46da0da445b4","created_at":"Fri Nov 01 19:39:49 UTC 2019","company":"Lawrence Berkeley National Laboratory ","company_url":"http:","location":"Berkeley, CA","title":"Software Engineer (Storage and I/O) ","description":"\u003cp\u003eSoftware Engineer (Storage and I/O) - 88690\nOrganization: NE-NERSC\u003c/p\u003e\n\u003cp\u003eBerkeley Lab’s National Energy Research Scientific Computing Center (NERSC) has an opening for a Software Engineer. This role will enable the Department of Energy (DOE) Office of Science researchers and the broader science community to benefit from improvements to HDF5 and other leading high-performance computing (HPC) storage and I/O software, developed on one of the world’s largest supercomputers. You will gain experience with cutting-edge storage technologies, such as scalable object file systems, burst buffers, and superfacility I/O, operate at extreme-scales and work in a collaborative environment with scientists and engineers from a wide variety of backgrounds.\u003c/p\u003e\n\u003cp\u003eYou will be part of a NERSC’s Data and Analytics Services group that supports experimental science and advanced analytics. You will also be part of multidisciplinary and cross-institution projects, involving academic and industry partners and renowned academics both in domain sciences as well as in storage and I/O.\u003c/p\u003e\n\u003cp\u003eWhat You Will Do:\n• Collaborate with scientists to develop new applications of I/O middleware for science - enabling science to scale to new heights.\n• Provide expert storage and I/O advice and consultancy services to scientists and users of NERSC computing resources.\n• Design new HPC storage architectures to improve potential for scientific discoveries in many fields.\n• Characterize the response of I/O systems on some of the world’s largest supercomputers  to scientific workflows.\n• Be part of a team to create, and advocate for, improvements to the HPC storage and I/O stack.\u003c/p\u003e\n\u003cp\u003eWhat is Required:\n• A Bachelor’s degree and a minimum of 8 years related experience; or a Master’s degree and 6 years and; or equivalent experience.\n• Experience with I/O middleware and familiarity with storage architectures and technologies.\n• Experience, knowledge, and / or significant interest in applying I/O middleware  optimizations to scientific data and applications.\u003c/p\u003e\n\u003cp\u003eDesired Qualifications:\n• A track record of I/O-related publications at supercomputing, storage, or domain science venues.\n• Proficiency in multiple programming languages such as C, C++, FORTRAN, Python, or related languages.\n• Familiarity with supercomputing infrastructure packages, such as MPI, OpenMP, etc.\n• Familiarity with multiple I/O middleware packages, file systems, and storage architectures (e.g. HDF5, netCDF, Lustre, Spectrum Scale, HSM, etc).\n• Familiarity with performance profiling, benchmarking, optimization and scaling of I/O middleware on HPC systems.\u003c/p\u003e\n\u003cp\u003eThe posting shall remain open until the position is filled.\u003c/p\u003e\n\u003cp\u003eNotes:\n• This is a full-time, 2 year term appointment with the possibility of extension or conversion to Career appointment based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.\n• This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.\n• Work will be primarily performed at Lawrence Berkeley National Lab, 1 Cyclotron Road, Berkeley, CA.\u003c/p\u003e\n\u003cp\u003eHow To Apply\nApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=172372\"\u003ehttp://50.73.55.13/counter.php?id=172372\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n\u003cp\u003eLearn About Us:\nBerkeley Lab (LBNL, \u003ca href=\"https://www.lbl.gov/\"\u003ehttps://www.lbl.gov/\u003c/a\u003e) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.\u003c/p\u003e\n\u003cp\u003eWorking at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities.  To view information about the many rewards that are offered at Berkeley Lab- Click Here(\u003ca href=\"https://hr.lbl.gov/\"\u003ehttps://hr.lbl.gov/\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eEqual Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision (\u003ca href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\"\u003ehttps://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\u003c/a\u003e) under 41 CFR 60-1.4.  Click here (\u003ca href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\"\u003ehttps://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\u003c/a\u003e) to view the poster and supplement: \"Equal Employment Opportunity is the Law.\"\u003c/p\u003e\n\u003cp\u003eLawrence Berkeley National Laboratory encourages applications from women, minorities, veterans, and other underrepresented groups presently considering scientific research careers.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=172372\"\u003ehttp://50.73.55.13/counter.php?id=172372\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEoyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a045dd961b42e3f471733076e675bb6c70b6f2a/Lawrence%20Berkeley%20Lab%20blue%20background.png"},{"id":"76fcadae-e84e-11e8-88fc-96a168773892","type":"Full Time","url":"https://jobs.github.com/positions/76fcadae-e84e-11e8-88fc-96a168773892","created_at":"Wed Nov 14 20:50:03 UTC 2018","company":"NBCUniversal","company_url":"https://www.nbcunicareers.com/","location":"Universal City, CA","title":"Media Software Engineer","description":"\u003cp\u003eResponsibilities :\u003c/p\u003e\n\u003cp\u003eCoding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.\u003c/p\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cp\u003eKnowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP \u0026amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism\u003c/p\u003e\n\u003cp\u003eDesired Characteristics\u003c/p\u003e\n\u003cp\u003eScope of activities within projects include:\nBusiness requirements, documentation \u0026amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf interested, please apply here: \u003ca href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\"\u003ehttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"9999f1f0-e448-11e8-966e-602e38acf303","type":"Full Time","url":"https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303","created_at":"Fri Nov 09 21:36:14 UTC 2018","company":"BlueVine","company_url":"http://bluevine.com","location":"Redwood City, Ca","title":"Senior Python Developer","description":"\u003cp\u003eAt BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eSenior Python Developer\u003c/strong\u003e at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build state-of-the-art web \u0026amp; mobile application using a variety of languages and tools\u003c/li\u003e\n\u003cli\u003eBuild distributed backend application in the cloud\u003c/li\u003e\n\u003cli\u003eUnderstand repeatable automated processes for building the application, test it, document it, and deploy it at scale\u003c/li\u003e\n\u003cli\u003eA desire to work as part of a growing, fast-paced, and highly-flexible team\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product designers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe able to develop a project through its entire lifecycle\u003c/li\u003e\n\u003cli\u003eHave strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines\u003c/li\u003e\n\u003cli\u003eProvide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of Python (4+ years)\u003c/li\u003e\n\u003cli\u003eKnowledge of Django (2+ years)\u003c/li\u003e\n\u003cli\u003eExperience with Celery, RESTful APIs and server-side APIs integration\u003c/li\u003e\n\u003cli\u003eKnowledge of ORM, SQL and Data Modeling\u003c/li\u003e\n\u003cli\u003eExperience with TDD and ability to write quality unit tests\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, devops and web security\u003c/li\u003e\n\u003cli\u003eKnowledge of JavaScript, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eAbility to quickly learn new technologies and adapt to a fast-paced development environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e[Senior Python Developer] (\u003ca href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e)\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"},{"id":"fa55ec4a-dd65-11e8-867f-7944d54de916","type":"Full Time","url":"https://jobs.github.com/positions/fa55ec4a-dd65-11e8-867f-7944d54de916","created_at":"Wed Oct 31 23:38:11 UTC 2018","company":"Bio-Rad Laboratories","company_url":"http://www.bio-rad.com","location":"Pleasanton, CA","title":"Backend Web Developer (Software Developer III Non-IT)","description":"\u003cp\u003eBackend Web Developer (Software Developer III Non-IT)\nBio-Rad Laboratories\u003c/p\u003e\n\u003cp\u003eOverview\nWho We Are and What We Do\u003c/p\u003e\n\u003cp\u003eBio-Rad is an established Fortune 1000 biotech company that creates products that help people live longer, healthier lives. Bio-Rad’s Digital Biology Group (DBG) in Pleasanton makes products (including data products) that are helping to eradicate cancer (among other things). We’ve worked hard at building a great culture here at the DBG that cultivates collaboration and innovation, and people are honestly really passionate about what they do here. Check Us Out\u003c/p\u003e\n\u003cp\u003eWhat We Are Looking For\u003c/p\u003e\n\u003cp\u003eA solid backend developer who will develop and own our cloud-based applications and platform for all our data products at the DBG. Are you passionate about delivering highly scalable and reusable code? Does driving and influencing cloud strategy at a Fortune 1000 company excite you?\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe one of the founding members of our new cloud data platform.\u003c/li\u003e\n\u003cli\u003eWork in a collaborative environment to apply well architected solutions within this space.\u003c/li\u003e\n\u003cli\u003eArchitect complex business logic and features to add to our web based applications from concept to implementation.\u003c/li\u003e\n\u003cli\u003eWork alongside Scientists, Marketing, and R\u0026amp;D Engineers through the Product Development life cycle and beyond.\u003c/li\u003e\n\u003cli\u003eDevelop / Improve the core infrastructure for high scalability.\u003c/li\u003e\n\u003cli\u003eWorking with an awesome group of humble, (super smart), hardworking team players that own their technical debt and slay it.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years’ experience as a Software Developer.\u003c/li\u003e\n\u003cli\u003eHands-on development experience with Python, Flask and Java in Linux environments.\u003c/li\u003e\n\u003cli\u003eHave successfully built scalable APIs according to best practices.\u003c/li\u003e\n\u003cli\u003eExperience with MySql, NoSQL databases, familiarity with Spark or Redshift Data warehousing.\u003c/li\u003e\n\u003cli\u003eExperience with Cloud Hosting (AWS preferred).\u003c/li\u003e\n\u003cli\u003eQuick learner with the ability to understand complex workflows and develop and validate innovative solutions to solve difficult problems.\u003c/li\u003e\n\u003cli\u003eExperienced with test automation: TDD, unit/integration/functional testing.\u003c/li\u003e\n\u003cli\u003eExperienced implementation efforts following an Agile software development lifecycle approach.\u003c/li\u003e\n\u003cli\u003eExcellent communication skills, both written and verbal.\u003c/li\u003e\n\u003cli\u003eA team-oriented contributor that aims to enhance the effectiveness of their colleagues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Bio-Rad:\u003c/p\u003e\n\u003cp\u003eBio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.\u003c/p\u003e\n\u003cp\u003eBio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.\u003c/p\u003e\n\u003cp\u003eEEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age\u003c/p\u003e\n\u003cp\u003eAgency Non-Solicitation:\u003c/p\u003e\n\u003cp\u003eBio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor full application instructions and position description, visit \u003ca href=\"http://apptrkr.com/1325674\"\u003ehttp://apptrkr.com/1325674\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405fc0cd9aa563ecebeb8a7c041756da5d943aa1/9cdade0a-86e8-468a-855c-c5e820ec6520"},{"id":"48d5274e-dd45-11e8-8130-eacb3354d656","type":"Full Time","url":"https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656","created_at":"Wed Oct 31 19:45:06 UTC 2018","company":"Traction","company_url":"https://www.tractionco.com/","location":"Sunnyvale, CA ","title":"Lead Full Stack Developer","description":"\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"9bd2d6fa-d7ee-11e8-9f5e-c14b0048f133","type":"Full Time","url":"https://jobs.github.com/positions/9bd2d6fa-d7ee-11e8-9f5e-c14b0048f133","created_at":"Thu Oct 25 00:41:02 UTC 2018","company":"Hello Design","company_url":"https://www.hellodesign.com","location":"Los Angeles, CA","title":"Full Stack Developer","description":"\u003cp\u003eHello is looking for a Full Stack Developer to help us make the future. Build award-winning interactive systems and collaborate with multi-disciplinary teams consisting of strategists, designers, and fellow programmers. We are looking for technologists who are passionate about their craft and have a drive for discovery and innovation.\u003c/p\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCan solve a problem in two ways\u003c/li\u003e\n\u003cli\u003eQuickly learn new languages and software\u003c/li\u003e\n\u003cli\u003eMaster of the MVC and MVVC design pattern\u003c/li\u003e\n\u003cli\u003eExpert in PHP, Python, and/or Node.js\u003c/li\u003e\n\u003cli\u003eExperienced in schemaless databases such as Mongo, Couch, Dynamo\u003c/li\u003e\n\u003cli\u003eCan work with multiple content management systems and speak to their strategies, advantages, and disadvantages\u003c/li\u003e\n\u003cli\u003eKnowledgeable with caching systems such as Redis, Memcache\u003c/li\u003e\n\u003cli\u003eFamiliar with AWS products such as EC2, ElastiCache, ECS, CloudFront, SQS, Elastic Transcoder, SNS\u003c/li\u003e\n\u003cli\u003eHave a working knowledge of JS Frameworks such as Backbone, Ember or AngularJS\u003c/li\u003e\n\u003cli\u003eComfortable working in a Linux environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAttributes\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDetailed and organized\u003c/li\u003e\n\u003cli\u003eExcellent communicator, written an verbal\u003c/li\u003e\n\u003cli\u003eAble to manage multiple projects simultaneously\u003c/li\u003e\n\u003cli\u003eResponsible and capable of meeting tight deadlines\u003c/li\u003e\n\u003cli\u003eEnjoy working in a collaborative environment\u003c/li\u003e\n\u003cli\u003ePassion for quality design and innovation\u003c/li\u003e\n\u003cli\u003eA thirst for learning\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHello is a creative agency driven to craft worthy experiences. We believe everything will be digital—surrounding us like the air we breathe. Our clients include Facebook, Nike, Tillamook, Sonos, Murad, and Supercell. Our work: hellodesign.com\u003c/p\u003e\n\u003cp\u003eWe offer competitive salary, 100% employer paid health and dental, 401(k) match, paid vacation, holidays including winter break, gym discounts, fully stocked snack rack, freshly ground coffee, and really cute dogs\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply using \u003ca href=\"https://www.linkedin.com/jobs/view/932516853\"\u003eLinkedIn\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOnly qualified applicants will be called for an interview. Please no phone calls or office visits.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDVYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7389dcbcfe7092331d653cc1f0caa3a5dca2e329/f9c740fb-f104-4833-a38b-d53bdd3930c5"}]